# İleri Birleştirme İşlemleri

In [2]:
import numpy as np
import pandas as pd

## Birebir Birleştirme

In [3]:
df1 = pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                    "grup":["Muhasebe","Muhendislik","Muhendislik","IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [5]:
df2 = pd.DataFrame({"calisanlar":["Veli","Ayse","Ali","Fatma"],
                    "ilk_giris":[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Veli       2010
1       Ayse       2009
2        Ali       2014
3      Fatma       2019

In [6]:
pd.merge(df1,df2) # paremetresiz kendi en uygun gordugunu esas alarak birlestirir

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2014
1       Veli  Muhendislik       2010
2       Ayse  Muhendislik       2009
3      Fatma           IK       2019

In [9]:
pd.merge(df1,df2, on ="calisanlar") # paremetreli birlestirmede yapilabiliyor

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2014
1       Veli  Muhendislik       2010
2       Ayse  Muhendislik       2009
3      Fatma           IK       2019

## Çoktan Teke

In [11]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2014
1       Veli  Muhendislik       2010
2       Ayse  Muhendislik       2009
3      Fatma           IK       2019

In [15]:
df4 = pd.DataFrame({"grup":["Muhasebe","Muhendislik","IK"],
                   "mudur":["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [16]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2014    Caner
1       Veli  Muhendislik       2010  Mustafa
2       Ayse  Muhendislik       2009  Mustafa
3      Fatma           IK       2019  Berkcan

## Çoktan Çoka

In [17]:
df5 = pd.DataFrame({"grup": ["Muhasebe","Muhasebe","Muhendislik","Muhendislik","IK","IK"],
                   "yetenekler":["matematik","excel","kodlama","linux","excel","yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [18]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [19]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim